class MainPlayer;

class MainPlayer
{
public:
char _0x0000[143];
	unsigned char isDead; //0x008F
	__int32 health; //0x0090 
char _0x0094[4];
	__int32 team; //0x0098 
char _0x009C[448];
	float posX; //0x025C 
	float posY; //0x0260 
	float posZ; //0x0264 
char _0x0268[228];
	unsigned char bodyState; //0x034C 
char _0x034D[4331];
	float flashAlpha; //0x1438 
char _0x143C[152];
	float lookingAtPlayer; //0x14D4 

};//Size=0x14D8